@extends('user_master')
@section('title')
    通報
@endsection
@section('call_input_active')
    active
@endsection
@section('content')
    <style>
        table, td, th {
            border: 0px solid black;
        }

        td {
            padding: 5px;
        }
    </style>
    <h4><b>我要通報</b></h4><hr>
    {!! Form::open(array('url' => 'call/input', 'method' => 'post','class' => 'form-horizontal', 'id' => 'formInput', 'onSubmit' => 'return checkForm();')) !!}
    <div class="col-xs-9 col-sm-6 col-md-6" >

        <table>
            <tr><td colspan="4"><font color="#ff0b11">*</font><b>地點</b></td></tr>
            <tr>
                <td>{!! Form::select('township', array('選擇區' => '選擇區'), '選擇區', ['id' => 'township', 'class' => 'form-control', 'onchange' => 'township_onchange()']) !!}</td>
            </tr>
            <tr>
                <td>{!! Form::select('street1', array('選擇路段' => '選擇路段'), '選擇路段', ['id' => 'street1', 'class' => 'form-control']) !!}</td>
                <td>和</td>
                <td>{!! Form::select('street2', array('選擇路段' => '選擇路段'), '選擇路段', ['id' => 'street2', 'class' => 'form-control']) !!}</td>
                <td>交叉路口</td>
            </tr>
            <tr>
                <td colspan="3">{!! Form::text('adressDetail','',['class' => 'form-control', 'placeholder' => '詳細位置', 'id' => 'adressDetail']) !!}</td>
            </tr>
            <tr><td colspan="4"><b>通報內容</b></td></tr>
            <tr>
                <td colspan="4">{!! Form::textarea('remark','',['class' => 'form-control ','style'=>'resize:none','required']) !!}</td>
            </tr>

        </table>
    </div>

    {{--<div class="col-xs-6 col-sm-4 col-md-4" >--}}
        {{--<table>--}}
        {{--</table>--}}
    {{--</div>--}}
    <div class="col-xs-6 col-sm-4 col-md-4" >
        <table>
            <br/>
            <tr><td colspan="4"><b>個人資料</b></td></tr>
            <tr>
                <td width="20%"><font color="#ff0b11">*</font>姓</td><td width="80%">{!! Form::text('lname','',['class' => 'form-control', 'required']) !!}</td>
            </tr>
            <tr>
                <td width="20%">名</td><td width="80%">{!! Form::text('fname','',['class' => 'form-control']) !!}</td>
            </tr>
            <tr>
                <td width="20%">性別</td><td>{!! Form::select('sex', array('請選擇' => '請選擇','男' => '男','女' => '女'), '請選擇', ['id' => 'sex', 'class' => 'form-control']) !!}</td>
            </tr>

            <tr>
                <td>聯絡電話</td><td colspan="3">{!! Form::text('phone','',['class' => 'form-control', 'id' => 'phone']) !!}</td>
            </tr>
            <tr>
                <td>E-mail</td><td  colspan="3">{!! Form::text('email','',['class' => 'form-control','type'=>'email', 'id' => 'email']) !!}</td>
            </tr>

            <tr>
                <td colspan="4"><font color="#ff0b11">※</font> 至少填寫1項聯絡方式，以方便我們聯絡您</td>
            </tr>
            <tr>
                <td colspan="4"><font color="#ff0b11">*</font> 請務必填寫</td>
            </tr>

        </table>
        <div class="text-center">
            <br>

            <br><br>
            {!! Form::submit('通報給救災中心', ['class' => 'btn btn-primary btn-sm']) !!}
        </div >
    </div>


    {!! Form::close() !!}
@endsection

@section('javascript')
    <script>
        function checkForm()
        {
            var read_email = {!! json_encode($email) !!};

            if($('#township').val() == "選擇區"){
                alert("請選擇區");
                $('#township').focus();
                return false;
            }
            if($('#adressDetail').val() == ""){
                if($('#street1').val() == "選擇路段" && $('#street2').val() == "選擇路段"){
                    alert("請選擇地點");
                    $('#street1').focus();
                    return false;
                }
                if($('#street1').val() != "選擇路段" && $('#street2').val() == "選擇路段"){
                    alert("請選擇另一路段或是填寫詳細位置");
                    $('#street2').focus();
                    return false;
                }
                if($('#street1').val() == "選擇路段" && $('#street2').val() != "選擇路段"){
                    alert("請選擇地點");
                    $('#street1').focus();
                    return false;
                }
            }
            if($('#adressDetail').val() != ""){
                if($('#street1').val() != "選擇路段" && $('#street2').val() != "選擇路段"){
                    alert("兩路交叉路口 及 詳細地點 請則一填選");
                    $('#adressDetail').focus();
                    return false;
                }
                if($('#street1').val() == "選擇路段" && $('#street2').val() != "選擇路段"){
                    $('#street1').focus();
                    return false;
                }
                return true;
            }
            if($('#sex').find(':selected').text() == "請選擇"){
                alert("請選擇性別");
                $('#sex').focus();
                return false;
            }
            if($('#phone').val() == "" && $('#email').val()=="")
            {
                alert("至少填寫1項聯絡方式");
                $('#phone').focus();
                return false;
            }
            if( !isPhone( $('#phone').val() ) )
            {
                return false;
            }
            if( $('#email').val() != "" && !isEmail( $('#email').val() ) )
            {
                return false;
            }
            if( $('#email').val() != "" && read_email.indexOf( $('#email').val() ) != -1){
                alert("此信箱已有人使用過!!");
                $('#email').focus();
                return false;
            }


            return true;
        }

        function isPhone(phoneNum) {
            if(phoneNum!=''){
                if(phoneNum.length == 10){
                    var regex = /^0[249]{1}[0-9]{8}$/;
                    if( !regex.test(phoneNum)){
                        alert("電話格式有誤，請檢查是否輸入正確");
                        return false;
                    }
                    else{
                        return true;
                    }
                }
                else if(phoneNum.length == 9){
                    var regex = /^0[345678]{1}[0-9]{7}$/;
                    if( !regex.test(phoneNum)){
                        alert("電話格式有誤，請檢查是否輸入正確");
                        return false;
                    }
                    else{
                        return true;
                    }
                }
                else{
                    alert("您輸入了" + phoneNum.length + "碼電話號碼\n請再次檢查您輸入的資料是否有誤\n若為市話請記得加上區碼");
                    return false;
                }
            }
            return true;
        }

        function isEmail(email) {
            var regex = /^[A-Za-z0-9]\w*\@[A-Za-z0-9]+((\.|-)[A-Za-z0-9]+)*\.[A-Za-z]+$/;
            if ( !regex.test(email) ) {
                alert("信箱格式不正確");
                return false;
            }
            else{
                return true;
            }
        }
//        alert();
    </script>
    <script>
        var township_array = new Array("選擇區","新興區", "前金區", "苓雅區", "鹽埕區", "鼓山區", "旗津區", "前鎮區", "三民區", "楠梓區",
                "小港區", "左營區", "仁武區", "大社區", "東沙群島", "南沙群島", "岡山區", "路竹區", "阿蓮區", "田寮區",
                "燕巢區", "橋頭區", "梓官區", "彌陀區", "永安區", "湖內區", "鳳山區", "大寮區", "林園區", "鳥松區",
                "大樹區", "旗山區", "美濃區", "六龜區", "內門區", "杉林區", "甲仙區", "桃源區", "那瑪夏區", "茂林區", "茄萣區");
        var rd_array = new Array(township_array.length);
        rd_array[0] = ["選擇路段"];
        rd_array[1] = ["選擇路段","七賢一路","七賢二路","八德一路","八德二路","大同一路","中山一路","中山二路","中山橫路","中正二路","中正三路",
                "中正四路","中東街","五福一街","五福一路","五福二路","仁智街","仁愛一街","仁愛二街","六合一路","六合二路","六合路",
                "文化路","文橫一路","文橫二路","民主路","民主橫路","民生一路","民生二路","民生新村","民有街","民享街","民族二路","民權一路",
                "民權街","玉竹一街","玉竹二街","玉竹三街","光華一路","同心路","同愛街","竹圍二巷","竹圍路","自立一路","自立二路","自立橫路",
                "和平一路","尚仁街","尚文街","尚信街","尚智街","尚義街","忠孝一路","明星街","東海街","林森一路","林森二路","河南一路",
                "河南二路","河南路","金門街","青年一路","信守街","南台路","南台橫路","南海街","南華一路","南華路","南華橫一路","南華橫二路",
                "洛陽街","球庭路","復橫一路","復興一路","復興二路","復興街","渤海街","開封路","黃海街","新田路","新興路","達仁街","福建街",
                "德生街","德智街","德順街","興邦路","興華路","錦田路"];
        rd_array[2] = ["選擇路段","七賢二路","八德二路","大同一路","大同二路","中山一路","中山二路","中山橫路","中正四路","中華三路","中華四路",
                "五福三路","仁義街","仁德街","允文街","六合二路","文武一街","文武二街","文武三街","市中一路","民生二路","永恆街",
                "生旺巷","光明街","光復一街","光復二街","光復三街","成功一路","自立一路","自立二路","自立橫路","自強一路","自強二路",
                "自強三路","育才街","旺盛街","明星街","武強街","河東路","河南二路","長生街","青年二路","前金一街","前金二街","南台橫路",
                "國民街","新田路","新盛一街","新盛二街","瑞源路","鼎盛街","榮安街","福音街","賢中街"];
        rd_array[3] = ["選擇路段","二聖一路","三多一路","三多二路","三多三路","三多四路","三多五路","大順三路","中山二路","中正一路",
                "中正二路","中東街","中華四路","中興街","五福一路","五福三路","五權街","仁智街","仁愛三街","仁義街","仁德街","允文街","六合路",
                "心正路","文山路","文昌路","文武三街","文橫二路","四維一路","四維二路","四維三路","四維四路","正大路","正言路","正順街","正義路",
                "民族二路","民權一路","永平路","永定街","永昌街","永明街","永泰路","永康街","永富街","永裕街","永靖街","永福街","永樂街",
                "永興街","光明街","光華一路","光華二路","同慶路","安康路","安業路","安溪路","安樂路","成功一路","成功二路","江都街","自強三路",
                "至誠路","行仁路","行信路","行禮街","身修路","和平一路","和平二路","宜昌街","尚志街","尚武路","尚勇路","尚義街","尚禮街",
                "忠孝二路","明德街","昇平街","林西二巷","林西街","林南街","林泉街","林富街","林森二路","林華街","林德街","武仁街","武昌路",
                "武信街","武智街","武義街","武聖路","武漢街","武廟路","武慶三路","武嶺街","武營路","河北路","河南路","金門街","青年一路","青年二路",
                "城西一巷","城西巷","城西街","建民路","建軍路","建國一路","建華街","泉州街","英明路","英祥街","英雄路","英義街","苓中巷",
                "苓中街","苓中路","苓安路","苓東路","苓南路","苓洲巷","苓雅一路","苓雅二路","苓雅市場","家齊路","泰成街","泰順街","泰豐街",
                "海邊路","國治路","凱旋一路","凱旋二路","凱旋三路","復興二路","惠安街","華新街","廈門街","意誠一巷","意誠巷","意誠路",
                "新田路","新光路","義勇路","漢昌街","漢泰街","漢陽街","福安路","福成街","福西街","福南二巷","福南三巷","福建街","福海街","福壽街","福德一路","福德二路","福德三路","維仁街","輔仁路","廣州一街","廣州二街","廣西路","廣東一街","廣東二街","德安街","樂仁路","樂善街","澄清路","輜汽路","學源街","憲昌路","憲法路","憲治路","憲政路","興中一路","興中二路"];
        rd_array[4] = ["選擇路段","七賢二路","七賢三路","大仁路","大公路","大安街","大成街","大有街","大勇市場","大勇路","大為街","大智路","大義街","大禮街","中正四路","五福四路","公園二路","北斗街","北端街","必忠街","必信街","田單街","光榮街","安石街","府北路","河西路","南興前街","南興後街","建國四路","莒光街","富野路","新化街","新樂街","新興街","壽星街","興華街","瀨南街","鹽埕街","堀江街"];
        rd_array[5] = ["選擇路段","九如四路","千光路","大順一路","大榮街","中華一路","元亨街","內惟路","文忠路","文信路","日昌路","平川街","正德路","民利街","民泰街","民康街","民強街","民富街","民樂街","永德街","伊犁街","安海街","安船街","至聖路","西藏街","吳鳳路","延平街","忠義路","昌盛路","明倫路","明華路","明誠三路","明誠四路","明德路","東門路","河川街","河西一路","河邊街","金川街","長安街","青松街","青泉街","青峰街","青海路","青雲街","南屏路","厚生路","厚安街","厚德路","建榮路","美明路","美術北一街","美術北三路","美術北五街","美術東一路","美術東二路","美術東三路","美術東四路","美術東五路","美術東六街","美術東七街","美術東八街","美術南一街","美術南二路","美術南三路","美術南五街","美術南六街","美術館路","美賢街","迪化街","哨船街","柴山","神農路","馬卡道路","捷興一街","捷興二街","清水巷","逢甲路","博愛一路","博愛二路","富農路","登山街","華安街","華欣路","華夏路","華泰路","華寧路","華榮路","華豐街","雄峰路","新疆路","瑞豐街","萬壽路","葆禎一街","葆禎路","裕民街","裕國街","裕誠路","裕興路","裕豐街","鼓山一路","鼓山二路","鼓山三路","鼓元街","鼓波街","鼓南街","壽山街","綠川街","翠華路","銀川街","銘傳路","慶豐街","蓮海路","蓬萊二路","蓬萊路","樹興街","篤敬路","興國路","興隆路","龍文街","龍水一街","龍水二路","龍水路","龍勝路","龍德路","濱海一路","濱海二路","環河街","臨海一路","臨海二路","臨海三路","臨海新路","麗雄街","鐵路街"];
        rd_array[6] = ["選擇路段","上竹巷","大關路","中洲一路","中洲二路","中洲三路","中洲巷","中港街","文正巷","北汕尾二巷","北汕尾三巷","北汕尾四巷","北汕尾五巷","北汕尾六巷","北汕尾八巷","北汕尾巷","北汕巷","永安巷","永興巷","吉祥巷","安住巷","安樂巷","自治巷","南汕巷","振興巷","海岸路","商港街","通山路","復興一巷","復興二巷","復興三巷","復興巷","敦和街","渡船巷","發祥街","慈愛巷","瑞竹街","義竹街","旗下巷","旗津一路","旗津二路","旗津三路","旗港路","廟前路"];
        rd_array[7] = ["選擇路段","一心一路","一心二路","一德路","七雄街","二聖一巷","二聖一路","二聖二巷","二聖二路","二聖三巷","二聖路","三多二路","三多三路","三多市場巷","三多巷","千富街","大禹街","大華一路","大華二路","大華三路","大華六街","中一路","中二路","中三路","中四路","中五路","中六路","中山二路","中山三路","中山四路","中山民營市場巷","中平路","中安路","中華五路","五甲三路","仁愛三街","公正路","天山路","天后街","天倫街","少康街","文林街","文橫三路","北江街","台塑二巷","台塑三巷","台塑四巷","台塑五巷","台塑六巷","台鋁一巷","台鋁二巷","台鋁三巷","台鋁四巷","台鋁五巷","台鋁六巷","台鋁七巷","台鋁八巷","台鋁九巷","台鋁十巷","台鋁十一巷","台鋁十二巷","台鋁十三巷","台鋁十四巷","台鋁十五巷","台鋁中巷","台鋁北巷","台鋁南巷","平樂街","正安街","正勤路","民瑞街","民裕街","民壽街","民興街","民豐街","民權二路","永豐路","立業街","光華二路","光華三路","同安路","向榮街","后平路","后安路","后南街","成功二路","旭原街","汕頭街","西一街","西二街","西三街","西四街","西五街","西六街","西七街","西八街","西九街","西十街","西十一街","西十二街","西十三街","西十四街","西十五街","西十六街","西十七街","西甲中巷","西甲西巷","西甲南巷","西海街","佛中路","佛公路","佛西街","佛佑路","佛宗街","佛東路","佛南街","佛道路","佛德街","育群街","育德路","育樂路","車站後街","和平二路","和昌街","和清街","和祥街","和隆街","和義街","和誠街","和運街","和豐街","忠民街","忠勤路","忠誠路","明正一街","明正二街","明正三街","明正東巷","明祥街","明衙路","明道一街","明道二街","明道三街","明道五街","明道六街","明道中街","明道北街","明道路","明鳳一街","明鳳二街","明鳳三路","明鳳五街","明鳳六街","明鳳七街","明鳳八街","明鳳九街","明鳳十街","明鳳十一街","明鳳十二街","明鳳十六街","明鳳十八街","明鳳二十街","明鳳二十二街","明鳳二十六街","明龍街","東一街","東二街","東三街","東四街","東五街","東六街","東七街","東八街","東九街","東十街","東十一街","東十二街","東十三街","東十四街","東十五街","東亞路","林森三路","林森四路","武德街","武慶一路","武慶二路","武營路","沱江街","金福路","長江街","信居街","信強街","信銘街","信龍街","保泰路","前鎮一巷","前鎮二巷","前鎮加工出口區","前鎮巷","前鎮第一公有臨時市場","前鎮街","南一路","南二路","南三路","南四路","南五路","南六路","南七路","南天街","南信街","南聖街","南衙路","南衙路南一巷","南衙路南二巷","南寧街","建南街","建基街","建盛街","建華街","建隆街","英明一路","英明路","英義街","英德街","英德橫巷","修文一...第六十三號碼頭","第六十四號碼頭","第六十五號碼頭","第六十六號碼頭","凱得街","凱旋三路","凱旋四路","凱旋市場巷","富新路","富樂街","復興三路","復興四路","復興新巷","景德路","港壽街","進村巷","隆昌街","隆興街","隆斌街","黃埔街","廉江街","新大路","新生路","新光路","新展路","新強路","新都路","新衙路","新福路","滇池街","溫江街","獅興街","瑞士街","瑞文街","瑞日街","瑞北路","瑞田街","瑞吉街","瑞安街","瑞西街","瑞孝街","瑞和街","瑞忠街","瑞東一街","瑞東二街","瑞信街","瑞南街","瑞政街","瑞春街","瑞恩街","瑞泰街","瑞崗一街","瑞崗二街","瑞崗三街","瑞祥街","瑞發街","瑞華街","瑞隆路","瑞雄街","瑞愛街","瑞義街","瑞聖街","瑞誠街","瑞達街","瑞福路","瑞賢街","瑞興街","萬和街","粵江街","聖德二街","衙仁街","衙平一街","衙平二街","衙平三街","衙竹一街","衙竹二街","衙竹三街","衙孝街","衙和一街","衙和二街","衙和三街","衙忠路","衙東街","衙松一街","衙松二街","衙松三街","衙信一街","衙信三街","衙泰街","衙國一街","衙國二街","衙國三街","衙梅一街","衙梅二街","衙梅三街","衙華街","衙愛街","衙義一街","衙義二街","衙義三街","衙慶一街","衙慶二街","衙慶三街","過港隧道","嘉陵街","實業路","漁港中一路","漁港中二路","漁港北一路","漁港北二路","漁港北三路","漁港東一路","漁港東二路","漁港東三路","漁港南一路","漁港南二路","漁港南三路","漁港路","福民街","福音一巷","福音二巷","福音三巷","福音四巷","福祥街","管仲南路","管仲路","精忠街","翠文街","翠亨北路","翠亨南路","翠村街","翠和街","翠福街","翠禮街","廣州三街","廣西路","廣東三街","德昌街","德昌路","賢明路","鄭和南路","鄭和路","憲德市場巷","憲德街","憲德戲院巷","樹人路","樹德路","興仁一巷","興仁路","興化街","興平路","興旺路","興陽街","興順街","興漁二路","興漁三路","興漁四路","衡山街","衡陽街","環區一路","環區二路","環區三路","環區四路","臨水南路","擴建一路","擴建路","豐漁二路","豐漁三路","鎮川一巷","鎮川二巷","鎮川三巷","鎮川四巷","鎮川五巷","鎮川六巷","鎮川七巷","鎮中路","鎮北一巷","鎮北二巷","鎮北三巷","鎮北四巷","鎮北五巷","鎮北六巷","鎮北七巷","鎮北八巷","鎮北九巷","鎮北十巷","鎮北巷","鎮州路","鎮邦街","鎮旺街","鎮昌一巷","鎮昌二巷","鎮昌三巷","鎮昌四巷","鎮昌五巷","鎮昌六巷","鎮昌七巷","鎮昌街","鎮東一街","鎮東二街","鎮東三街","鎮東四街","鎮東五街","鎮東六街","鎮東街","鎮洋路","鎮原街","鎮海一街","鎮海二街","鎮海三街","鎮海四街","鎮海五街","鎮海六街","鎮海七街","鎮海八街","鎮海路","鎮國路","鎮富街","鎮港路","鎮發街","鎮華街","鎮榮街","鎮慶街","鎮賢街","鎮興路","籬仔內路"];
        rd_array[8] = ["選擇路段","九如一路","九如二路","九如三路","九如新村","力行路","力行橫巷","十全一路","十全二路","十全三路","三民街","三鳳九巷","三鳳十一巷","三鳳十二巷","三鳳中街","三德西街","士良街","大中一路","大利街","大享路","大和街","大昌一路","大昌二路","大連街","大港街","大順一路","大順二路","大順三路","大園街","大裕路","大福街","大德街","大慶街","大興街","大豐一路","大豐二路","山東街","中山一路","中仁街","中和街","中原街","中峰街","中庸街","中都街","中華一巷","中華二路","中華三路","中華橫四巷","中華橫巷","中華橫路","中愛街","中道街","仁愛一巷","六合路","天民路","天津街","天宮街","天祥一路","天祥二路","文安南街","文揚街","文樂街","文衡路","文龍路","文濱路","日全街","水源路","北平一街","北平二街","北安街","台安街","四平街","市中一路","平等路","本和街","本松街","本館路","正忠路","正氣街","正義路","正興路","正豐街","民本街","民成街","民壯路","民孝路","民和街","民信路","民族一巷","民族一路","民族二路","民族巷","民祥街","民業路","民禮路","民豐路","永吉街","永年街","立人街","立志街","立忠路","立強街","立富街","立德街","光武路","光富路","光裕路","吉林街","同協路","同愛街","同盟一路","同盟二路","同盟三路","合江街","安東街","安寧街","有光路","自由一路","自立一路","自行一巷","自忠街","自重街","自強一路","西安街","克武路","克強路","孝順街","更新街","汾陽路","育英街","和平一路","和順街","宗元街","延吉街","延慶街","忠孝一路","承德街","昌平街","昌富街","昌裕街","明仁路","明吉路","明哲路","明誠一路","明誠二路","明福街","明賢街","林森一路","松江街","武功巷","河北一路","河北二路","河堤南路","河堤路","牧場後巷","臥龍路","金山路","金陵街","金鼎路","長明街","青年路２段","青島街","信國路","保生街","南台路","南華路","哈爾濱街","宣化街","建工路","建中路","建元路","建安街","建和街","建昌路","建武路","建國一路","建國二路","建國三路","建國路３段","建德路","建興三巷","建興路","建興橫巷","恆豐街","春陽街","昭良街","秋元街","美都路","重慶街","修武街","唐山街","旅順街","晉元街","泰安街","泰康街","堅如路","康平街","康德街","教仁路","清光街","清明街","清風街","清朗街","清華街","清榮街","清興街","淵明街","淵源街","莊敬路","通化街","凱國路","凱旋一路","凱歌路","博仁街","博愛一路","博愛一橫巷","喜峰街","堯山街","復興一路","惠德街","敦化街","敦煌路","朝陽街","皓東路","華德街","開原街","陽明路","順昌街","黃興路","愛國路","新民路","萬全街","綏遠一街","綏遠二街","義仁街","義永路","義光街","義安街","義利街","義和路","義忠街","義昌路","義明街","義發街","義華路","義德路","裕誠路","鼎力路","鼎山街","鼎中路","鼎仁街","鼎文街","鼎正街","鼎吉街","鼎安路","鼎成街","鼎和街","鼎昌街","鼎金一巷","鼎金二巷","鼎金二橫巷","鼎金三巷","鼎金六巷","鼎金中街","鼎金後路","鼎信街","鼎勇街","鼎泰街","鼎強街","鼎祥街","鼎富路","鼎華路","鼎貴路","鼎順街","鼎愛街","鼎新路","鼎瑞街","鼎義街","壽昌路","嫩江街","寧夏街","實踐巷","察哈爾一街","察哈爾二街","漢口街","漢中街","銀杉街","德山街","德北街","德利街","德旺街","德勝街","德裕街","德興街","慶雲街","撫順街","潼關街","澄平街","澄和路","澄明街","澄清路","澄照街","熱河一街","熱河二街","熱河三街","褒忠街","褒揚東街","褒揚街","憲政路","興安街","興昌街","興隆街","遼北街","遼寧一街","遼寧二街","遼寧三街","錦田路","錦州街","龍江街","應安街","應昇路","聯興路","歸綏街","瀋陽街","禮明路","豐年街","鎮安巷","懷安街","寶安街","寶鼎街","寶興路","繼光街","覺民路","灣中街","灣復街","灣愛街","灣興街"];
        rd_array[9] = ["選擇路段","三山一巷","三山二巷","三山三巷","三山四巷","三山街","久昌街","土庫一路","土庫二路","土庫三路","土庫四路","土庫五路","土庫六路","土庫七街","土庫八街","土庫北路","土庫路","大同新村","大德新村","大學一街","大學二街","大學三街","大學五街","大學六街","大學七街","大學九街","大學十街","大學十一街","大學十三街","大學十五街","大學十六街","大學十七街","大學十八街","大學十九街","大學二十街","大學二十一路","大學二十二街","大學二十三街","大學二十五路","大學二十六街","大學二十七街","大學二十八街","大學二十九路","大學三十街","大學三十一街","大學三十二街","大學三十五街","大學三十六街","大學三十八街","大學四十二街","大學四十六街","大學四十八街","大學五十街","大學五十二街","大學五十六街","大學五十七街","大學五十八街","大學六十街","大學六十二街","大學西路","大學東路","大學南路","中一街","中二街","中三街","中央路","中昌街","中泰街","仁昌街","元昌街","內環北路","內環東路","內環南路","水管路","加仁路","加宏路","加昌路","加昌路六十九橫巷","北內環東路","北昌街","右昌一巷","右昌忠義一巷","右昌忠義二巷","右昌忠義三巷","右昌忠義四巷","右昌忠義五巷","右昌忠義六巷","右昌忠義七巷","右昌忠義八巷","右昌忠義九巷","右昌街","外環西路","左楠路","民昌街","玉田街","立仁街","立民路","立安路","吉昌街","安民街","安泰街","安通街","宏昌街","宏毅一路","宏毅一路自強巷","宏毅二路","宏毅二路北一巷","宏毅二路北二巷","宏毅二路北三巷","宏毅二路北四巷","宏毅二路北五巷","宏毅二路北六巷","宏毅二路北七巷","宏毅二路北八巷","宏毅二路南一巷","宏毅二路南二巷","宏毅二路南三巷","宏毅二路南四巷","宏毅二路南五巷","宏毅二路南六巷","宏毅二路南七巷","宏毅二路南八巷","宏毅二路南九巷","宏毅二路南十巷","宏毅二路南十一巷","宏毅二路南十二巷","宏毅三路","秀昌街","秀群路","卓越路","和光街","岳陽街","東昌街","金田街","青田街","青田路","青埔街","青農路","信昌街","勇昌街","南昌街","建楠路","建楠橫路","後昌新路","後昌路","後勁中街","後勁北路","後勁西路","後勁東路","後勁南路","美昌街","軍校路","晉昌街","泰良街","泰昌街","海專路","益民路","益群路","高昌街","高峰街","高雄大學路","高楠公路","高楠公路屏山巷","健民街","區東路","國昌街","常盛街","常順街","常德一路","常德路","常興街","啟昌街","清平街","清安街","清成街","清泰路","清壽路","清福路","清豐一路","清豐二路","清豐三路","清豐路","盛昌街","通昌街","創意南路","創新路","富昌街","惠心街","惠民路","惠昌街","惠春街","惠豐街","援中路","援港路","景昌街","智昌街","智群路","朝仁路","朝明路","朝陽路","朝新路","開發路","新安街","新昌街","新建南路","新泰街","新開發路","新經一路","楠泰街","楠梓加工區西一街","楠梓加工區西二街","楠梓加工區西三街","楠梓加工區西五街","楠梓加工區西六街","楠梓加工區西七街","楠梓加工區西八街","楠梓加工區東二街","楠梓加工區東三街","楠梓加工區東五街","楠梓加工區東六街","楠梓加工區東七街","楠梓西巷","楠梓東街","楠梓新路","楠梓新路鐵路住宅","楠梓路","楠梓路河濱巷","楠梓舊街","楠盛街","楠都西巷","楠都東街","楠陽路","楠裕街","瑞仁路","瑞平路","瑞昌街","瑞昌路","瑞屏路","萬昌街","經一路","經二路","經三路","經四路","經五路","經六路","經建路","聖雲街","裕昌街","壽民路","壽豐路","旗楠路","旗楠路長安巷","榮昌街","榮新街","監理北街","監理南街","監理街","福興街","翠屏路","鳳楠路","廣昌街","德中路","德正路","德民路","德孝街","德信街","德祥路","德富街","德惠路","德維街","德維路","德賢路","德豐街","慶昌街","樂群路","學專路","翰林路","興文街","興西路","興泰街","興盛街","興楠路","興楠橫巷","錦屏街","藍田路","藍昌路","寶昌街","寶溪北街","寶溪南街","芎林一街","芎林二街","芎林三街","芎林四街","芎林五街","芎林六街","芎林七街","芎林路","芎蕉一街","芎蕉二街","芎蕉三街","芎蕉五街","芎蕉路"];
        rd_array[10] = ["選擇路段","二美街","二苓路","下橫路","上林街","大平路","大地街","大房路","大林路","大業北路","大業南路","大潭路","大鵬路","小港一街","小港二街","小港路","小港路庫房巷","小港路菜市巷","山田路","山田路山邊巷","山明路","山邊路","山沓路","中山四路","中心路","中光街","中安路","中亨街","中利街","中林路","中船一村","中船二村","中智街","中鋼路","丹山一路","丹山二路","丹山三路","丹山四路","天池路","天順街","孔宅一街","孔宅二街","孔宅三街","孔宅五街","孔宅六街","孔宅七街","孔宅八路","孔宅十街","孔宅街","孔明街","孔祥街","孔鳳新路","孔鳳路","水秀路","世全路","北林路","台機路","台糖路","平允街","平心街","平正街","平和一路","平和二路","平和四路","平和五路","平和六路","平和七路","平和九路","平和十路","平和西路","平和東路","平和南路","平和路","平和路新市巷","平治街","平格街","平順街","平誠街","民治路","民益路","民航一街","民航二街","民航三街","民義街","民德街","永光街","永和街","永忠街","永春街","永順街","永義街","玉豐街","立群路","立憲街","光和路","光盛街","光陽街","光輝街","光耀街","同利路","安和街","旭日街","旭東街","江山街","百善街","行義街","利昌街","孝光街","孝先街","宏仁街","宏文路","宏平路","宏光街","宏志街","宏和街","宏忠街","宏林街","宏信街","宏茂街","宏泰","宏泰街","宏偉街","宏智街","宏裕街","岐山一路","岐山二路","秀峰街","亞太路","其明街","其美街","店中路","店仔後街","店北路","店陽街","店鳳街","忠德街","明芳街","明義街","明聖街","東亞南路","東亞路","東昇街","東林路","東高街","松山街","松山街尾厝巷","松仁街","松文街","松平街","松正路","松光街","松安街","松和路","松直街","松金街","松青街","松信路","松南街","松柏街","松美路","松泰街","松崗路","松頂街","松富街","松華路","松愛街","松義街","松達街","松福街","松樂街","松興路","沿海一路","沿海二路","沿海三路","沿海三路友成巷","沿海四路","金府路","金城路","金鋁街","長青街","長春街","長泰街","長興街","青山街","信義二路","南北路","南星路","建成街","後厝路","茂大街","茂林街","飛機路","宮仁街","宮平街","宮田街","宮安街","宮和街","桂仁街","桂文街","桂平街","桂田街","桂州街","桂江街","桂竹街","桂和街","桂忠街","桂明街","桂華街","桂陽路","桂園路","桂義街","桂聖街","桂誠街","桂德街","桂興街","泰興街","海汕一路","海汕二路","海汕三路","海汕四路","海汕五路","高坪一街","高坪二街","高坪三街","高坪五路","高坪六街","高坪七路","高坪八路","高坪九街","高坪十街","高坪十一路","高坪十二街","高坪十三街","高坪十五路","高坪十六街","高坪十七街","高坪十八路","高坪十九街","高坪二十街","高坪二十一街","高坪二十二路","高坪二十三路","高坪二十五路","高坪二十六街","高坪二十七南街","高坪二十七街","高坪二十八街","高坪二十九路","高坪三十街","高坪三十一街","高坪三十二街","高坪三十三街","高坪三十五街","高坪三十六街","高坪三十七路","高坪三十八街","高坪三十九街","高坪五十路","高坪五十二街","高坪五十六街","高坪五十八街","高坪六十街","高坪六十二街","高坪六十六路","高坪六十八街","高坪七十街","高坪七十二街","高坪七十六街","高坪七十八街","高坪八十街","高松路","高鳳路","崇文路","崇本街","崇安街","崇明街","崇善街","崇愛街","崇敬街","崇聖街","康莊路","第六十八號碼頭","第六十九號碼頭","第七十號碼頭","第七十一號碼頭","第七十二號碼頭","第七十三號碼頭","第七十四號碼頭","第七十五號碼頭","第七十六號碼頭","第七十七號碼頭","第七十八號碼頭","第七十九號碼頭","第八十號碼頭","第八十一號碼頭","紹興街","頂橫路","勝安街","博學路","復華路","朝天街","朝福街","朝鳳街","朝德街","朝興路","港中街","港平路","港安街","港信路","港後路","港美街","港盛街","港順街","港源街","港壽街","港福街","港興街","華山路","華仁街","華文街","華立街","華昌路","華明街","華美街","華盛街","廈莊一街","廈莊二街","廈莊三街","廈莊四街","廈莊五街","廈莊六街","敬業街","敬業路","新生路","新昌街","新厝路","新豐街","瑞明街","義興街","農園路","達德街","嘉興街","漢文路","漢民路","漢志街","漢威街","福利路","福利路大厝巷","福隆街","福祿街","福德西巷","維安街","翠亨南路","鳳北路","鳳池街","鳳西街","鳳東街","鳳林路","鳳林路新生巷","鳳城街","鳳盛街","鳳華路","鳳陽街","鳳源路","鳳福路","鳳鳴路","鳳德街","鳳興路","鳳興路新市場巷","廠西路","廠東一路","廠東二路","廠東三路","廠前路","廠橫路","廠邊一路","廠邊二路","廠邊三路","德仁街","德仁路","德文街","德平街","樂利路","學成一街","學成二街","學府路","糖業路","興業街","鋼平街","鋼成街","鋼成街東巷","龍門街","龍華街","龍鳳路","龍興路","營口路","營前街","臨海新村","豐田街","豐登街","豐善街","豐街","豐點街","寶山街"];
        rd_array[11] = ["選擇路段","大中一路","大中二路","大順一路","子華路","中央市場","中央市場乙","中央市場甲","中信路","中海路","中華一路","介壽路","元帝路","天祥二路","太原街","太華街","孔聖路","孔營路","文上路","文川路","文才街","文天路","文水路","文平街","文守路","文自路","文育路","文奇路","文府路","文直路","文科街","文恩路","文康路","文強路","文理街","文莊路","文智路","文萊路","文慈路","文敬路","文瑞街","文瑞路","文寧街","文德路","文學路","世運大道","半屏山後巷","左營下路","左營大路","左營新路","正化街","正心街","民族一路","立大路","立中路","立文路","立明街","立明路","立信路","立莊路","立道路","光興街","先勝街","先勝路","先鋒路","合群新村","安吉街","自由二路","自由三路","自由四路","自立新村","自助新村","自治新村","自勉新村","自勉路","至真路","至聖路","西陵街","辛亥路","和光街","孟子路","店仔頂街","店仔頂路","忠言路","忠信路","忠貞街","明倫路","明華一路","明誠二路","明德新村","明潭路","東自助新村","東門路","果峰街","保靖街","南屏路","城峰路","屏山新村","建業新村","後昌路","政德路","洲仔北街","洲仔東街","洲仔巷","洲仔路","軍校路","重上街","重仁路","重化街","重化路","重文街","重平路","重立路","重光路","重吉路","重如街","重安路","重孝路","重和路","重忠路","重明路","重治路","重信路","重建路","重政路","重美街","重偉街","重清路","重惠街","重景街","重愛路","重義路","修明街","海功東路","海功路","海平路","海明街","海富路","海景街","海德路","烏松路","站前北一路","站前北路","站前南路","站前路","高鐵路","埤子頭街","埤子頭路","埤西巷","崇實新村","崇實路","崇德路","廍後街","鳥松路","創造巷","創造新村","勝利路","博愛二路","博愛三路","博愛四路","富民路","富國路","復興新村","曾子路","華欣路","華夏路","華泰路","菜公一路","菜公巷","菜公路","進學路","郵工新村","慈暉三村","慈暉六村","慈暉九村","新下街","新上街","新中街","新吉街","新南街","新莊一路","新勝街","新榮街","新庄仔路","義民巷","群英街","聖公路","裕誠路","裕興路","鼓山三路","嘉慶街","實踐路","榮光街","榮成一街","榮成二街","榮成三街","榮佑路","榮富街","榮華街","榮德街","榮總路","榮耀街","福山國小","維新街","翠明路","翠峰路","翠華路","德威街","慕義巷","緯六路","緯九路","蓮潭路","龜山巷","勵志新村","環山路","環潭路","舊城巷"];
        rd_array[12] = ["選擇路段","八德一路","八德二路","八德中路","八德北路","八德西路","八德東路","八德南路","大正一街","大正二街","大正三街","大正四街","大正五街","大正路","大全一巷","大全二巷","大同一巷","大同一街","大同二巷","大同二街","大同南街","大成街","大昌街","大信巷","大春一街","大春二街","大春三街","大春街","大景一街","大景二街","大智一街","大智二街","大智三街","大智路","大義巷","大福街","大德街","大禮街","大豐街","工業一路","工業二路","中山路","中正路","中華路","中興巷","五和路","仁山一街","仁山二街","仁山街","仁心路","仁心路博愛巷","仁文街","仁立街","仁光路","仁安一巷","仁安二巷","仁安三巷","仁孝路","仁和東街","仁和南街","仁和街","仁忠一街","仁忠二街","仁忠三街","仁忠四街","仁忠五街","仁忠六街","仁忠七街","仁忠八街","仁忠九街","仁忠十街","仁忠路","仁怡一街","仁怡二街","仁怡街","仁林路","仁信巷","仁勇西巷","仁勇東巷","仁勇路","仁春巷","仁春街","仁祥街","仁智街","仁雅街","仁雄路","仁雄舊街","仁慈一街","仁慈二街","仁慈三街","仁慈四街","仁慈五街","仁慈六街","仁慈七街","仁慈八街","仁慈路","仁愛巷","仁新巷","仁義巷","仁德巷","仁樂街","公館一巷","公館二巷","公館三巷","文中一街","文中二街","文中三街","文中四街","文中路","文化巷","文北街","文安一街","文安二街","文安街","文明巷","文東路１段","文東路２段","文南一街","文南二街","文南三街","文南四街","文南街","文教一街","文教二街","文教街","文達一街","文學一街","文學二街","文學三街","文學四街","文學五街","文學六街","文學七街","文學八街","文學九街","文學西街","文學路１段","文學路２段","文興一巷","文興二巷","文興三巷","文興四巷","文興五巷","文館路","水管路","水管路２段","水管路３段","北屋五街","北屋六街","市場巷","正安街","永仁街","永宏巷","永和一街","永和二街","永和三街","永和四街","永和五街","永和北街","永和街","永昌一街","永昌二街","永昌三街","永昌四街","永新一街","永新二街","永新三街","永新四街","永新五街","永新六街","永新七街","永新南街","永榮一街","永榮二街","永榮三街","永樂街","同和路","名山一街","名山二街","名山三街","名山四街","名山五街","名山六街","名山七街","名山八街","名山九街","名山十街","名山街","名光街","名湖街","圳北巷","地政街","安樂一街","安樂二街","安樂三街","安樂四街","安樂東街","成功路","旭成街","竹工一巷","竹工二巷","竹工三巷","竹東路","竹門巷","竹門街","竹業巷","竹楠路","西一巷","西二巷","赤仁路","赤北巷","赤吉街","赤西一街","赤西二街","赤西三街","赤西四街","赤西五街","赤西中街","赤和街","赤東一街","赤東二街","赤東三街","赤東四街","赤東五街","赤東六街","赤勇路","赤南巷","赤祥街","赤富街","赤貴街","京中一街","京中二街","京中三街","京中四街","京中五街","京吉一路","京吉二路","京吉三路","京吉四路","京吉五路","京吉六路","京吉七路","京富路","和平巷","林山巷","林森巷","信義巷","信德街","南亞街","南昌巷","南勢巷","南興巷","建興巷","後港巷","後庄巷","高楠一街","高楠二街","高楠三街","高楠四街","高楠五街","高楠六街","高楠七街","高楠八街","高楠九街","高楠十街","高楠公路","高楠北街","高鐵路","埤內巷","埤南巷","博愛巷一弄","博愛巷二弄","博愛巷三弄","博愛巷四弄","博愛巷五弄","博愛巷六弄","富德街","復興巷","渡假山莊","善德街","華中街","華北街","華東街","華南街","華園街","華興街","慈安街","慈育街","慈英街","慈惠一街","慈惠二街","慈惠三街","新中街","新元街","新生巷","新生路","新吉街","新旺一街","新旺二街","新祥街","新瑞街","新鳳街","新興巷","新龍街","新鴻街","新寶街","新庄巷","新庄路","義大二路","嘉東路","寧靜巷","福德街","綠園新村","維新巷","閤興一巷","閤興二巷","閤興三巷","鳳仁路","鳳仁路仁平巷","德新街","德榮街","澄仁西街","澄仁東街","澄仁路","澄合一街","澄合二街","澄合三街","澄合四街","澄合五街","澄合六街","澄合街","澄信街","澄清巷","澄新一街","澄新二街","澄新三街","澄新四街","澄新五街","澄新六街","澄新七街","澄新八街","澄新九街","澄新十街","澄新十一街","澄新街","澄德路","澄觀路","澄觀路１段","澄觀路２段","橫山一巷","橫山二巷","橫山三巷","興昌巷","環湖路","灣內一巷","灣內二巷","灣內三巷","灣內四巷","灣內五巷","灣內街"];
        rd_array[13] = ["選擇路段","力行巷","三中路","三民路","大仁路","大正街","大吉路","大同路","大安街","大成街","大社工業區","大社路","大智街","大順街","大新路","大聖街","大德街","大興街","中山路","中仁路","中正路","中華路","中興一巷","中興二巷","中興三巷","中興四巷","中興五巷","仁愛路","文化路","文和街","文昌街","文明路","文信街","文康街","文華路","文聖路","文福街","日新巷","水哮巷","北勢巷","民生路","民治路","民族路","民權路","永宏巷","永保街","永華街","田中巷","田頂一巷","田頂二巷","田頂四巷","光明街","光華路","安康街","成功一巷","成功二巷","成功三巷","成功四巷","成功六巷","自由路","自強街","行堂巷","和平一巷","和平二巷","和平三巷","和平四巷","和平五巷","和平路１段","和平路２段","和成街","忠孝路","明園巷","明毅街","金龍路","信義路","保舍甲路","保糖街","柑宅巷","苗圃巷","食坑巷","神農路","堂內巷","桶寮巷","復興路","新生街","新興路","萬金巷","萬金路","經建路","蜈潭巷","過甲一巷","過甲二巷","過甲三巷","過甲四巷","嘉新巷","嘉誠路","壽山巷","旗楠路","翠屏路","學府路","磚廠街","興工路","塩埕巷"];
        rd_array[14] = ["選擇路段","東沙"];
        rd_array[15] = ["選擇路段","南沙"];
        rd_array[16] = ["選擇路段","一德南路","一德路","二高路","人和巷","三民路","久和路","久龍街","大仁北路","大仁南路","大仁路","大公路","大全街","大同巷","大成街","大昌街","大勇街","大埔一街","大埔二街","大莊路","大富街","大智街","大新街","大義二路","大德一路","大德二路","大德三路","大遼路","大寶街","大埕街","山隙路","中山北路","中山南路","中崙寮路","中華西一街","中華西三街","中華路","仁安街","仁和路","仁義路","仁壽南路","仁壽路","仁壽路忠勤新村","介壽西路","介壽東路","介壽路","介壽路慈恩二十五村","公園北路","公園西路","公園西路２段","公園西路３段","公園東路","公園路","友情路","友愛巷","文化一街","文化二街","文化街","文賢市場","文賢路","台上一路","台上路","巨輪路","平和東街","平和路","本工一路","本工二路","本工三路","本工五路","本工六路","本工七路","本工西一路","本工西二路","本工西三路","本工西路","本工東一路","本工東二路","本工南一路","本工南二路","本工路","本工環北路","本工環東路","本洲一街","本洲二街","本洲三街","本洲五街","本洲六街","本洲工業區","本洲路","正言街","正氣路","民主路","民生街","民有路","民享路","民治路","民族南一街","民族南三街","民族路","永樂街","田厝一路","田厝二路","田厝路","白米路","石潭北一街","石潭北二街","石潭北三街","石潭北街","石潭東一街","石潭東街","石潭路","石潭路橫巷","光潭路","吉安街","守信巷","成功路","拕子一街","拕子二街","拕子三街","拕子中街","拕子北街","拕子南街","竹圍中街","竹圍北街","竹圍西街","竹圍東街","竹圍南街","竹圍路","自由巷","宏中街","育才路","育仁街","育英路","育智街","育德街","育樂巷","協仁街","協北巷","協和街","協和路","協榮路","協德街","和平巷","和平路","官舍路","岡山北路","岡山南路","岡山路","岡山路岡農新村","岡榮路","岡燕路","忠孝路","忠誠街","明孝巷","明得街","河堤路１段","河堤路２段","河華路","空醫院路","金興街","阿公店路２段","阿公店路３段","青年街","信中街","信義街","前和路","前峰路","後協路","後紅路","後興北路","柳橋西路","柳橋西路１段","柳橋西路２段","柳橋東路","洲港路","為隨西路","為隨東路","為隨路","致遠路","重義街","宮中街","峰西巷","校前路","祐民巷","站東街","健鷹南路","國軒路","崑山西巷","崑山東巷","崗德路","康樂路","清水路","眾和巷","通校路","廍後路","頂紅街","頂潭北路","頂潭路","博仁街","富貴西街","富貴路","惠東巷","登科街","程香路","華夏二村","華夏新村","華崗路","華園一路","華園二路","華園路","菜寮路","開元街","慈恩十一村","慈恩十三村","新建路","新樂街","新庄路","溪西路","溪東路","筧橋路","聖得路","聖森路","嘉為街","嘉峰路","嘉華路","嘉新西路","嘉新東路","嘉新東路２段","嘉新路","嘉興路","壽天路","壽華路","碧紅街","福壽巷","精忠街","維仁路","維新東街","維新路","劉厝路","樂群路","潭底路","曉風新村","樹人路","興北巷","興東巷","興隆街","醒路","勵志二路","勵志路","環工東路","懷德路","寶米路","警悟巷","鐵路巷","鹽埔路","灣裡路"];
        rd_array[17] = ["選擇路段","一甲路","三公路","三民路","下甲路","大仁路","大公路","大同路","大社路","大勇路","大智路","大德路","中山南路","中山路","中正路","中和街","中華路","中興路","五公路","仁愛路","天祐路","太平路","文化路","文南路","北嶺一路","北嶺二路","北嶺三路","北嶺五路","北嶺六路","四維路","平和路","平海路","平等街","民主路","民生路","民有路","民治路","民強街","民族路","民富街","民權路","永華路","永福路","立大路","成功路","竹南街","自由街","自立街","自強街","延平路","忠孝路","東安路","社龍街","金平路","長興路","信義路","保民路","保生街","保安路","建國路","後鄉路","倫理街","海安路","國昌路","莊敬街","博愛街","復興路","智仁街","智勇街","智義街","華山路","華正路","華光路","華昌街","順安路","新民路","新生路","新興路","聖母街","路科一路","路科二路","路科三路","路科五路","路科六路","路科七路","路科八路","路科九路","路科十路","道德街","寧安街","福德街","潭墘路","環球路"];
        rd_array[18] = ["選擇路段","大埤","中山路","中正路","中路","仁愛路","文學一街","文學二街","民生路","民族路","民權路","永豐路","玉庫","石安","再興","成功街","和平路","忠孝路","青旗","信義路","建國","峰北","峰南","崙頂","崗山","復安","港後"];
        rd_array[19] = ["選擇路段","七星路","大同路","大安路","大新路","大滾水","大坵園","小滾水","山隙","中坑","內安","內寮","公館","月球路","牛寮","古亭路","古亭路水庫巷","古亭路廟後巷","外安","平安路","田埔","田草崙","田寮路","西德路","西德路山腳巷","西德路田尾巷","西德路石牌巷","西德路新廍巷","西德路糖廠巷","秀峰","和興路","松子腳","長山路","南安路","南勢湖","後山","茅草山","茄苳湖","埔頂","崁下","崁頂","崇德路","崇德路山頂巷","崇德路北勢巷","崇德路社區巷","崇德路崇西巷","崇德路興德巷","崑山路","崙尾","崗北路","崗安路","崗南路","鹿埔路","鹿埔路鹿北巷","鹿埔路鹿南巷","湖底","湖裡","筏路頭","菜堂","新路","新興路","過溪","旗亭巷","興東路","應菜龍","鹽水"];
        rd_array[20] = ["選擇路段","力行路","下市場","大山巷","大仁路","大占巷","大成路","大勇巷","大埔巷","大學路","大遼路","工程路","中北路","中民路","中生巷","中安路","中竹路","中西路","中東巷","中南路","中華路","中路巷","中興北路","中興路","內湖巷","北一路","四林路","市場路","正德新村","永興巷","田尾巷","石尖巷","安中路","安北路","安正路","安西路","安招路","安東街","安林一街","安林二街","安林三街","安林四街","安林五街","安林六街","安林路","安南二路","安南路","安新路","安慶路","尖山巷","成大街","成功路","角宿路","角宿路北巷","車林巷","和尚巷","拖砧巷","東川路","林厝巷","牧場路","臥牛巷","金山路","南一巷","南勢巷","後角巷","後荷巷","後龍巷","紅山巷","迪化路","師大路","海成一街","海成二街","海成三街","海成北街","海成東街","海成南街","海成街","海峰路","烏山巷","高鐵總廠路","埤底巷","崎溜巷","深中路","深水路","深興路","湖內巷","番田路","新生南路","新生路","新厝巷","溪底巷","義大路","裕農巷","過鞍巷","滾水路","鳳加路","鳳西巷","鳳東路","鳳旗路","鳳澄路","鳳龍巷","鞍平巷","橫山路","燕南二街","燕南三街","燕新一街","燕新二街","燕新三街","燕新五街","興隆巷","興龍路","瓊招路","瓊林路","瓊興路","麒麟巷","寶頂一街","寶頂東街","寶頂巷"];
        rd_array[21] = ["選擇路段","三仙路","三仙路德美巷","三民路","三民路文化巷","三德西路","三德路","大仁路","大同路","大昌路","大學南路","中正路","中崎路","中崎路光復巷","中崎路速路邊","中崎路關聖巷","中崎路灣子溝","五林路","五林路惠明巷","公厝北路","公園東街","公園南街","仕元路右邊巷","仕元路左邊巷","仕田路右邊巷","仕田路左邊巷","仕和里忠孝巷","仕隆南路","仕隆路","仕隆路公舘一巷","仕隆路公舘二巷","仕隆路正心巷","仕隆路李厝巷","仕隆路林厝巷","仕隆路校邊巷","仕隆路馬厝巷","仕隆路陳厝巷","仕隆路博愛巷","仕隆路曾營巷","仕隆路進校巷","仕隆路進學巷","仕豊南路","仕豊南路大同巷","仕豊南路大崎巷","仕豊南路大義巷","仕豊南路仕龍西巷","仕豊南路仕龍東巷","仕豊南路仕龍南巷","仕豊南路仕龍巷","仕豊南路仕豊北巷","仕豊路","仕豊路四維巷","仕豊路五常巷","仕豊路五福巷","仕豊路六合巷","仕豊路大同巷","仕豊路大崎巷","仕豊路仁愛巷","仕豊路公館巷","仕豊路文武巷","仕豊路永吉一巷","仕豊路永吉二巷","仕豊路成功巷","仕豊路和平巷","仕豊路忠孝巷","仕豊路長記巷","仕豊路信義巷","仕豊路神農巷","仕豊路博愛巷","仕豊路溝尾巷","北堺西路","市場街","民主街","民生路","民生路南段","田中路","甲田路","甲典街","甲昌路","甲昌路文昌巷","甲昌路市場巷","甲昌路通山巷","甲昌路復興巷","甲昌路華昌巷","甲昌路華富巷","甲昌路華榮巷","甲昌路華興巷","甲昌路華豐巷","甲昌路隆昌巷","甲昌路輝興巷","甲昌路龍泉巷","甲南里豐田巷","甲圍路","甲圍路建北巷","甲圍路建東巷","甲圍路建南巷","甲圍路復興巷","甲圍路豐田巷","甲新路","甲新路廟邊巷","甲樹路","白樹路","白樹路六合巷","白樹路王家巷","白樹路先永巷","白樹路合作巷","白樹路長壽巷","白樹路界樹巷","白樹路莒光巷","白樹路新興巷","合興街","成功北路","成功南路","成功南路中銀疏散處","成功南路仁義巷","成功南路孝義巷","成功南路忠孝巷","成功南路青埔","成功南路青埔巷","成功南路青埔溪邊","成功南路青埔橋邊巷","成功南路信義巷","成功南路通校巷","成功南路智義巷","成功南路新生巷","成功南路機耕站","成功南路禮義巷","成功路","成功路中山巷","成功路新市巷","西林路","西林路文明巷","西林路市場巷","西林路正成巷","西林路光復巷","西林路明德巷","西林路建國巷","西林路秋尾巷","西林路通黃巷","西林路壹豐巷","西林路復興巷","西林路黃內巷","西林路新生巷","西林路福德巷","西林路鐘內巷","佛神路","村中路","秀正路","秀正路康樂巷","秀正路新興巷","育才街","芋林路","芋林路文明巷","芋林路壽生巷","芋林路廟邊巷","芋寮路","芋寮路仁愛巷","芋寮路文明巷","芋寮路和平巷","芋寮路忠孝巷","芋寮路信義巷","芋寮路南段","芋寮路壽生巷","芋寮路廟邊巷","芋寮路禮義巷","里林西路","里林西路文化巷","里林西路文明巷","里林西路明光巷","里林西路明德南巷","里林東路","里林東路公路巷","里林東路北光二巷","里林東路明德南巷","里林東路南光巷","里林東路柯厝巷","里林東路頂頭巷","里林東路楊厝巷","里林東路溪北巷","里林東路興樹巷","里林東路鐵路東巷","里林東路鐵路南巷","典昌路","明神路","明神路定祥巷","明德路","明德路明德巷","東林路","東林路明德巷","東林路通黃巷","林北路","林西路","林頭路","林頭路自立巷","林頭路家和巷","林頭路國興巷","河北路","社邊路","南北路","南北路廟後巷","南溝路","南溝路２段","南溝路２段自力一巷","南溝路２段自力二巷","南溝路２段神農巷","南溝路中街巷","南溝路中溝巷","南溝路昌隆巷","南溝路明仁巷","南溝路明忠巷","南溝路明信巷","南溝路明義巷","南溝路東南巷","南溝路金福一巷","南溝路金福二巷","南溝路唐莊巷","南溝路智發巷","南溝路隆興巷","南溝路義成巷","建樹路","建樹路中興巷","建樹路文興巷","建樹路民生巷","建樹路民權巷","建樹路成功巷","建樹路前厝巷","建樹路建國巷","建樹路通北巷","建樹路勝利巷","建樹路復興巷","建樹路維仁巷","美德街","海峰路","站前街","站前街復興巷","站前街鐵路北舍","站前街鐵路南舍","球場路","莊敬路","莊敬路自強一巷","莊敬路自強二巷","通典路","通德路","通樹路","通燕路","創新路","復興西路","朝福路","筆秀東路","筆秀東路光明巷","筆秀路","筆秀路秀成巷","筆秀路和平巷","筆秀路忠孝巷","筆秀路信義巷","筆秀路農舍巷","筆秀路廟前巷","隆智街","隆豐路","隆豐路忠德巷","隆豐路振昌巷","隆豐路維新巷","隆豐路銘昌巷","新生路","新生路定福巷","新東一街","新東五街","新東六街","新莊路","新莊路大昌巷","新莊路定吉巷","新莊路定安巷","新莊路保金巷","新莊路保隆巷","新莊路保慶巷","新興路","新興路文化巷","新興路新一巷","新興路新二巷","瑞祥一街","瑞祥二街","瑞祥三街","瑞祥五街","經武路","聖公路","農場路","精忠新村","德松路","德松路仁愛巷","德松路民族巷","德松路光明巷","德松路和平巷","德松路忠孝巷","德松路信義巷","德松路劉厝巷","樹和路","樹德路","橋中街","橋南路","橋南路大井巷","橋南路大溝巷","橋南路中興巷","橋南路水宮巷","橋南路吉尾巷","橋南路雅歌巷","橋南路新社巷","橋南路養豬場巷","橋南路戲院巷","橋南路舊市巷","橋南路鐵路邊巷","橋新二路","橋新三路","橋新五路","橋新六路","橋新七路","橋新環路","橋燕路","橋頭路","橋頭路大井巷","橋頭路中興巷","橋頭路林厝巷","糖北路","糖南路","糖南路糖南巷","糖廠路","糖廠路廠區一巷","糖廠路廠區二巷","興樹路","興樹路民生巷","興樹路字豪巷","興樹路成功巷","興樹路東林段","興樹路橫通巷","興糖路","營邊路","豐祥路","鐵道北路","鐵道北路溪邊巷","鹽田路","鹽田路建豐巷","鹽田路通典巷","鹽田路通德巷","鹽南路","鹽南路建昌巷"];
        rd_array[22] = ["選擇路段","八德路","大宅街","大舍北路","大舍西路","大舍東路","大舍東路公厝巷","大舍東路聖公巷","大舍南路","工維街","中正二街","中正三街","中正四街","中正五街","中正六街","中正路","中崙路","中崙路市場巷","中學路","仁愛路","仁愛路必信巷","公園北街","公園西街","公園東街","公園南街","公館路","四維路","四維路自強巷","平安街","平等路","民權街","光明路","光明路市場巷","共和路","同安路","同安路民生巷","自由路","赤崁北路","赤崁西路","赤崁東路","赤崁南路","赤崁南路自立巷","赤崁南路保生一巷","赤崁南路保生二巷","赤崁南路保生三巷","赤崁南路保生四巷","赤崁南路樹人巷","和平路","忠孝路","信安街","信義路","信德街","信興一路","信興二路","展寶路","展寶路永生巷","展寶路永存巷","海景路","梓官路","梓官路大宅巷","梓官路城隍巷","淵官路","通安路","通港路","通港路通港巷","復興街","港一街","港二街","港三街","港四街","港五街","港六街","港七街","港八街","港九街","港十街","進學路","進學路必忠巷","嘉好路","嘉好路惠民巷","嘉展路","嘉展路文宏一巷","嘉展路文宏二巷","漁港一路","漁港二路","廣澤路","樹德街","機場路","禮仁路","禮智路"];
        rd_array[23] = ["選擇路段","二高路","山頂路","山霸畑路","中山路","中正北路","中正西路","中正西路廟前巷","中正西路廟後巷","中正東路","中正南路","中正路","中正路自由巷","中華路","仁愛街","公園路","文安北路","文安北路明仁巷","文安路","文安路三點山巷","文安路四巷南弄","文安路文和巷","文安路北一巷","文安路北二巷","文安路北三巷","文安路北中巷","文安路北東巷","文安路寺巷","文安路東段","文安路廟巷","四維路","民生街","民權街","光和北路","光和路","光復街","安樂路","安樂路北一巷","安樂路北二巷","安樂路南巷","成功北路","自力路","和平路","忠孝路","青和街","南寮路","南寮路山下巷","南寮路中山巷","南寮路光明巷","南寮路光華一巷","南寮路光華二巷","南寮路光華三巷","南寮路光華四巷","南寮路光華五巷","南寮路光華中巷","南寮路光華北巷","南寮路光華西巷","南寮路光華巷","美和街","海尾路","國校路","淵仔塭","產業路","產業路西一巷","產業路西二巷","產業路東一巷","產業路東二巷","復興街","進學路","新生街","新興路","新庄路","新庄路大管巷","過港路","過港路成功巷","過港路西一巷","過港路西二巷","漯底路","漁港一街","漁港路","樂安路","樂安路山下一巷","樂安路山下二巷","樂安路山下三巷","樂安路廟東巷","樂安路廟巷","學校路","舊港路","舊港路北一巷","舊港路北二巷","舊港路北三巷","舊港路西一巷","舊港路西二巷","舊港路東一巷","舊港路東二巷","舊港路東巷","舊港路東段","舊港路南一巷","舊港路南二巷","舊港路港邊巷","舊港橫路","舊港橫路１段","舊港橫路北二巷","舊港橫路北三巷","舊港橫路北五巷","舊港橫路南二巷","舊港橫路魚塭","鹽港一路","鹽港二路","鹽港二路千歲一巷","鹽港二路千歲二巷","鹽港二路北巷","鹽港二路和平一巷","鹽港二路和平二巷","鹽港二路東一巷","鹽埕大路","鹽埕大路北一巷","鹽埕大路西一巷","鹽埕大路西二巷","鹽埕中路","鹽埕中路西一巷","鹽埕中路西二巷","鹽埕中路西三巷","鹽埕中路東一巷","鹽埕中路東二巷","鹽埕中路東三巷","鹽埕中路東四巷","鹽埕中路信義巷","鹽埕中路智仁巷","鹽埕北路"];
        rd_array[24] = ["選擇路段","中華街","仁愛街","永工一路","永工二路","永工三路","永工五路","永工六路","永工七路","永工九路","永工十路","永安工業區","永安路","永華路","永新路","永達路","和平街","忠孝街","保安路","保寧路","保興一路","保興二路","保興三路","復興路","新華路","新興路","維新路","維新路光明一巷","維新路光明二巷","維新路光明三巷","維新路光明五巷","維新路光明六巷","維新路光明七巷","維新路光明八巷","維新路光明九巷","維新路光明十巷","興達路","興達路興達巷","鹽保路"];
        rd_array[25] = ["選擇路段","大湖東路","大湖路","中山路１段","中山路２段","中正路１段","中正路２段","中華街","仁愛街","天祐路","充龍街","正義一路","正義二路","民生街","民族街","民權路","成功街","自強街","和平路","忠孝街","東方路","東方路１段","武功街","長春一街","長春二街","長春三街","長春四街","長春五街","長壽路","信義路","保生路","建國街","清水街","湖中路","新興街","寧靖街","福生一街","福生二街","福生三街","福生四街","福生五街","福安路","環球北路","環球路"];
        rd_array[26] = ["選擇路段","一市場","一成街","一致街","七成街","七雄街","七聖街","二市場","二成街","二和街","二儀街","八成街","八德路","八德路２段","力行路","三民路","三光街","三成街","三商街","三誠路","三誠路一橫巷","大仁街","大同街","大明路","大東一路","大東二路","大德街","工協街","工協新村","中山西路","中山東路","中山路","中央商場","中正路","中安街","中安路","中利街","中和街","中信街","中泰街","中崙一路","中崙二路","中崙四路","中崙五路","中崙路","中崙橫巷","中華街","中樂街","中興街","五甲一路","五甲二路","五甲二路臨一巷","五甲三路","五甲路","五甲路南成三巷","五成街","五常街","五福一路","五福二路","五權南路","五權路","仁和街","仁愛路","仁義街","六成街","六法街","公園一街","公園二街","公園三街","公園街","天興街","太平一巷","太平二巷","太平三巷","太平四巷","太平新村","文山中二巷","文山路","文山路園藝巷","文中街","文仁街","文化西路","文化路","文平街","文正路","文安街","文西街","文育街","文和街","文昌一街","文昌二街","文昌街","文明街","文東街","文武街","文勇街","文南街","文建街","文英路","文苑街","文康街","文教路","文清街","文智街","文湖街","文華街","文雅東街","文雅街","文殿街","文聖街","文福街","文鳳路","文德路","文樂街","文澄街","文學街","文興街","文衡路","文龍東路","文龍路","文濱路","文豐街","文藝街","水管路","王生明路","王生明路市場巷","北仁街","北文街","北平路","北田街","北辰街","北和街","北昌一街","北昌二街","北昌三街","北昌四街","北昌五街","北昌路","北明街","北盛街","北祥街","北堤街","北華街","北隆街","北榮街","北維街","北賢街","北興街","四海街","四維街","平等路","正氣街","正義街","民生路","民安街","民族路","民興路","永安街","永和街","永忠街","永義街","永誠街","永福街","田中央路","田衙路","甲智路","立人街","立志街","立信街","立德街","光明路","光復路","光復路１段","光復路２段","光華東路","光華南路","光華路","光榮街","光遠東路","光遠路","同明街","合作街","安寧街","成功新村","成功路","老爺二街","老爺四街","自由路","自立街","自治街","自強一路","自強二路","西湖街","協和路","和平路","和成路","和德街","和興街","府前路","忠水街","忠孝街","忠義街","忠誠路","明和街","明昌西街","明昌街","明鳳十三街","明學路","明龍街","杭州西街","杭州東街","杭州街","東門街","東福街","林森路","松江街","武昌路","武林路","武松街","武慶二路","武營路","武營路台緘新村","河堤街","油管路","花園街","長安街","長明街","長樂街","長興街","青年路１段","青年路２段","信義街","保生路","保安一街","保安二街","保成一路","保成二路","保孝街","保忠街","保南一路","保南二路","保泰路","保華一路","保華二路","勇志街","南一街","南二街","南三街","南正一路","南正二路","南光街","南安路","南成街","南江街","南京路","南和一路","南和街","南昌街","南盛街","南富街","南華一路","南華路","南華路東巷","南貴街","南進一街","南進二街","南進三街","南進四街","南進五街","南進六街","南進七街","南榮路","南福街","建國路１段","建國路２段","建國路３段","紅毛港路","家和一街","家和二街","家和三街","家和五街","家和六街","家和七街","海光四村","海光四村市場","海洋一路","海洋二路","真君路","高鳳一路","偉成街","國民街","國光路","國昌路","國泰路１段","國泰路２段","國富路","國隆路","國慶一街","國慶二街","國慶三街","國慶五街","國慶六街","國慶七街","國慶八街","國慶九街","國慶十街","國慶十一街","國慶十二街","國興街","埤北路","埤頂街","埤頂路","崗山北街","曹公路","祥和街","莒光三村","陸航二村","頂昌街","頂明路","頂茂街","頂圃街","頂富街","頂園街","頂新一街","頂新二街","頂新三街","頂新五街","頂新六街","頂新七街","頂新八街","頂新九街","頂新十街","頂新十一街","頂新路","頂聖街","頂賢街","頂興街","頂豐街","頂庄一街","頂庄路","凱旋路","勝利南路","勝利路","勝利路南巷","勝利路顯惠一巷","勝利路顯惠二巷","博愛路","富新路","復仁街","復華一街","復華街","復興街","智成街","善士街","善志街","善和街","善政街","善美路","華山街","華北街","華江街","華西街","華明街","華泰街","華興街","開明街","黃埔二村","黃埔二村西一巷","黃埔二村西二巷","黃埔二村西五巷","黃埔二村東四巷","黃埔三村","黃埔四村","黃埔五村","黃埔六村","黃埔七村","黃埔七村特一巷","黃埔新村","黃埔新村西一巷","黃埔新村西二巷","黃埔新村西三巷","黃埔新村西四巷","黃埔新村西五巷","黃埔新村西六巷","黃埔新村東一巷","黃埔新村東一橫巷","黃埔新村東二巷","黃埔新村東二橫巷","黃埔新村東三巷","黃埔新村東四巷","黃埔新村東五巷","黃埔新村東六巷","黃埔新村國校巷","黃埔路","園中路","園茂路","園盛路","園墘路","慈暉新村","新民街","新生街","新生街１段","新甲路","新安街","新昌街","新泰街","新國街","新康街","新強路","新富路","新樂街","溪濱路","瑞大街","瑞中街","瑞光一巷","瑞光二巷","瑞光街","瑞安路","瑞竹路","瑞和街","瑞昌街","瑞明街","瑞芳街","瑞春街","瑞智街","瑞進路","瑞隆東路","瑞順街","瑞鳳街","瑞興路","瑞豐市場","經武路","裕昌街","誠北街","誠平路","誠和路","誠東街","誠勇路","誠智街","誠愛一街","誠愛路","誠義路","誠群街","誠德街","誠體街","過仁街","過昌街","過勇路","過埤路","過智街","過雄一街","過雄街","實踐四村","漢泰中路","漢慶街","漁村街","漁南街","福安一街","福安二街","福祥街","福誠一街","福誠二街","福誠三街","福誠四街","福誠五街","福德街","維武路","維新路","翠亨北路","鳳仁路","鳳北路","鳳甲一街","鳳甲二街","鳳甲路","鳳育路","鳳明街","鳳東一街","鳳東二街","鳳東三街","鳳東五街","鳳東六街","鳳東七街","鳳東路","鳳林路","鳳松路","鳳松路北市場","鳳南一路","鳳南路","鳳埤街","鳳崗路","鳳崗路鳳儀巷","鳳捷路","鳳頂路","鳳翔新村","鳳誠路","鳳學路","鳳燕一街","鳳燕二街","樂園街","澄清路","輜汽北一路","輜汽北二路","輜汽南路","輜汽路","憲光八村","興隆街","錦田路","錦富街","龍成路","龍關新村","濱山街","環河東街","環河街","臨海街","鎮北北巷","鎮北街","鎮東街","鎮東路","鎮南街","雙慈街","寶陽路","體育路","灣頭一街","灣頭北巷","灣頭南巷"];
        rd_array[27] = ["選擇路段","九和路","八德路","力行路","三隆里光華路","三隆路","上寮路","大仁街","大同街","大有一街","大有二街","大有三街","大有四街","大明街","大信街","大勇街","大智街","大業街","大漢路","大寮里光華路","大寮路","大德街","山頂路","工商路","干城路","中正路","中華北巷","中興里光華路","中興路","中興路中興一巷","中興路中興二巷","中興路中興三巷","中興路中興四巷","中興路中興五巷","中興路中興六巷","中興路中興七巷","中興路中興八巷","中興路中興九巷","中興路中興十巷","中庄路","仁孝路","仁和路","仁忠路","仁勇路","仁隆街","仁愛路","仁義路","仁德新村","仁德路","仁德路１段","內坑路","內厝路","六和路","公園街","文化路","文化路文化一巷","文化路文化二巷","文化路文化三巷","文化路文化四巷","文化路文化五巷","文化路文明十六巷","文化路文明二十六巷","文化路文明四十巷","文化路文明四十二巷","文化路文明巷","文昌路","文明路","文華街","文隆街","文新巷","文德街","水源路","北興路","台貿路","四維路","平等路","打鐵店街","正大街","正心路","正忠街","正氣路","正隆街","正義路","民仁街","民生路","民光街","民安街","民成街","民和街","民忠街","民昌街","民信街","民勇街","民政街","民泰街","民強街","民族路","民祥街","民勝街","民富街","民揚路","民智街","民華街","民貴街","民順街","民義街","民慶街","民興街","民權街","永仁街","永吉街","永安街","永和街","永昌街","永芳路","永春街","永洋街","永盛街","永華街","永隆街","永群街","永興街","田單一街","田單二街","田單三街","田單四街","田單五街","田單六街","田單七街","立隆街","立德路","光明路１段","光明路２段","光明路３段","光復路","光華路東巷","吉祥街","吉隆街","同德街","安隆街","成功路","江山路","自由路","自立路","自強街","至學路","利民街","快樂街","秀隆街","佳隆街","和祥街","周廣街","尚義街","幸福街","忠孝路","忠隆街","忠義路","承德街","昌隆街","明隆街","明德路","明德路美和巷","東隆街","果協路","林內路","林厝路","武昌街","河堤路３段","金華街","長生街","長和街","長春街","長泰街","長榮街","長樂街","青山街","青川街","青峰街","青華街","青雲街","信隆街","信義路","保生街","保福路","保德街","前庄路","宣武路","巷尾路","建民街","建國街","建業路","建德街","後庄街","拷潭路","美滿街","格致街","琉球路","翁園路","健康街","商協路","商協福利路","國華街","崇仁街","崇文街","崇明街","崇恩路","崇偉路","崇惠路","崇善路","崇聖路","崇賢路","捷西路","淑德新村","莒光一街","莒光二街","莒光三街","莊敬路","勝利街","博愛街","富民街","富隆街","復興北路","復興南路","復興南路山上巷","景秀街","景明街","景美街","景隆街","智理街","華一街","華二街","華三街","華五街","華六街","華七街","華八街","華中南路","華中路","華西路","華東路","華隆街","華德街","華興巷","貿商四村","貿商九村","貿商路","進學路","開封街","黃厝路","慈光新村","慈隆街","新一街","新二街","新三街","新五街","新六街","新七街","新八街","新中街","新民街","新生街","新安街","新厝路","新強街","新富街","會結路","溪寮路","溪寮路２段","瑞祥街","瑞隆街","萬丹路","萬隆街","義和路","義發路","義隆街","裕民街","農場路","過溪里光華路","過溪路","嘉新新村","嘉新路","福安街","福隆街","福源路","福祿街","福德街","鳳明路","鳳林一路","鳳林一路慈惠巷","鳳林二路","鳳林三路","鳳林四路","鳳林四路興中巷","鳳林路４段","鳳屏一路","鳳屏二路","影七路","德昌街","潮仁路","潮平路","潮安路","潮和路","潮忠路","潮信路","潮勇路","潮發路","潮順路","潮寮里光華路","潮寮路","潮德路","潮興路","潮龍路","濃一街","濃二街","濃三街","濃中街","濃公路","興中街","興隆路","興業路","濱北街","濱南街"];
        rd_array[28] = ["選擇路段","一心街","力行路","三官路","下山腳","下厝路","下磘溝","上林街","大安一街","大安三街","大安五街","大安六街","大安八街","大安路","大和街","大義路","工業一路","工業二路","工業三路","中正路","中芸二路","中芸三路","中芸路","中門路","中厝路","中港路","五福路","仁愛路","文化街","文心街","文昌街","文聖街","文賢北路","文賢南路","王公一路","王公二路","王公路","北汕二路","北汕路","半廍路","占岸路","民有路","田厝路","石化一路","石化二路","石化三路","石化四路","立志街","安和街","成功街","西汕路","西溪里後厝路","西溪路","和平路","忠孝西路","忠孝東路","忠義一街","忠義二街","忠義二街市場巷","忠義三街","東汕路","東林西路","東林東路","林山巷","林內路","林家一路","林家路","林家路１段","林園北路","林園南路","沿海路１段","沿海路２段","沿海路３段","沿海路４段","金潭路","信義路","前厝路","校前路","海墘路","康樂街","清水岩路","頂厝路","頂磘溝","魚塭","堤防路","港埔一路","港埔二路","港埔三路","港嘴一路","港嘴二路","港嘴三路","開南街","陽明街","椰樹","椰樹東巷","椰樹南巷","溪州一路","溪州二路","溪州三路","過溝一巷","過溝二巷","漁港路","福興街","鳳林路１段","鳳林路２段","鳳林路３段","鳳芸二路","鳳芸路","鳳新街","廣應街","潭平路","潭頭路","龍潭路","龍潭路竹坑巷","龔厝里後厝路","龔厝路","檨林巷"];
        rd_array[29] = ["選擇路段","大仁北路","大仁東路","大仁南路","大同路","大同路大榮巷","大同路立峰巷","大同路裕農巷","大竹路","大竹路水坑巷","大昌路","大昌路大德巷","大明街","大埤南路","大埤路","大埤路力行巷","大埤路涵碧巷","大智路","大華路","大義街","山水路","山明街","山腳路","山腳路忠勤巷","中山西路","中山路","中正路","中正路東豐巷","中正路恆山西巷","中正路恆山南巷","中正路恆山巷","中正路興農巷","仁勇路","仁美路","仁愛一路","仁愛二路","仁愛路","仁聖路","仁德路","介壽路","公園路","天津路","文前路","文前路文北巷","文前路文南一巷","文前路文南二巷","文前路市場巷","文前路南巷","文前路綠莊巷","文海街","文華路","文賢街","水管路","北平路","本昌路","本華路","本興路","本舘路","本舘路文昌巷","本舘路文明巷","本舘路立人巷","本舘路立志巷","本舘路立言巷","本舘路立德巷","本舘路橫巷","正修路","民生路","民族路","民權路","永昌街","永康街","永善路","立昌街","立群街","光華街","同心街","同富街","江埤路","竹安街","汾陽路","育英街","育善一街","育德一街","赤山湖","和盛西街","和盛東街","和盛街","奉化街","忠仁路","忠孝路","忠信街","忠義路","忠誠路","昌文街","昌明街","昌武街","昌發街","昌隆街","明湖路","明華街","東山路","東山路橫一巷","松竹西街","松竹街","松美路","松埔北巷","松埔南巷","松埔路","松富路","松藝路","金華街","長青街","長春路","青雲街","建華街","美山路","美山路市場巷","美竹街","美勝一街","美勝二街","美勝三街","美勝四街","美勝五街","美勝六街","美勝七街","美德一街","美德二街","美德三街","美庄路","埔仁街","埔孝街","埔忠街","埔智街","埔愛街","神農路","高碼一巷","高碼一路","高碼二巷","高碼二路","高碼三巷","高碼四巷","高碼五巷","高碼六巷","高碼七巷","國公路","清華街","清華街本昌巷","球場路","球場路文中一巷","球場路文中二巷","球場路文中巷","球場路文化巷","球場路文化橫巷","球場路文心巷","球場路文康巷","球場路文德巷","鳥松路","華山一街","華山二街","華山路","華美路","華榮一街","華榮二街","華榮三街","華榮路","圓山北路","圓山路","溫州街","瑞華中街","瑞華街","嘉興街","夢裡西巷","夢裡東巷","夢裡南巷","夢裡路","夢裡路夢祥巷","福德路","德華街","澄明街","澄清路","澄湖路","澄新一街","澄新二街","澄新三街","澄新五街","澄新六街","澄新七街","學堂路","興華街","龍華北街","龍華南街","應安路","濱山街","濱湖東路","濱湖路","坔埔路"];
        rd_array[30] = ["選擇路段","九大路","九大路河濱一巷","九大路河濱二巷","九曲路","九曲路北極巷","力行街","三和路","久堂路","久堂路自強巷","久堂路城隍巷","久堂路博愛巷","久堂路湖底一巷","久堂路湖底二巷","久堂路湖底三巷","久堂路鐵路巷","大坑路","大莊","大樹路","大樹路北巷","大樹路南巷","大樹路新榮巷","小坪路","中山路","中正一路","中正一路大坪巷","中華路","中華路國小巷","中興北路","中興北路安樂巷","中興西路","中興東路","中興南路","中興南路新立巷","中興南路新興巷","中興街","中興街王爺巷","中興街台糖巷","中興街市場二巷","中興街市場巷","井腳路","友隆","瓦厝街","立竹街","安和街","竹寮路","和山路","和平街","姑山路","忠義","武昌","長春路","長春路保安巷","長春路新吉巷","長春路新春巷","信義街","信誼路","建村街","建村街陳厝巷","神農街","統嶺路","復興街","復興街勝利巷","新生街","新社街","新社街大同巷","新鎮路","溪埔路","義大一街","義大二街","義大五街","義大六街","義大七街","義大八街","義大十街","義大十一街","義大十二街","義大十三街","實踐街","綠陽","蓬萊","學城路１段","樹城街","興山路","興田路","龍目路"];
        rd_array[31] = ["選擇路段","力行巷","力行街","三民巷","三和巷","三桃巷","上口巷","上洲街","大山街","大仁街","大同街","大坑巷","大里街","大岸巷","大林街","大勝巷","大森巷","大福巷","大德路","中山南街","中山路","中正里中興街","中正路","中宅巷","中西巷","中南街","中洲路","中洲路溝底巷","中華路","中寮一路","中寮二路","中學路","仁山巷","仁和街","仁愛街","仁義巷","仁福巷","元通路","內湖巷","六張犁巷","公園路","天寮巷","文中路","文和巷","文進巷","日新街","北山巷","北興巷","市場巷","平和街","民生一街","民生二街","民享街","民族一街","民族二街","民族三街","民裕巷","民權一街","民權二街","民權三街","永平街","永安街","永和街","永福街","田埔巷","石岩巷","光正街","光復一街","光復二街","吉祥街","合和街","安全巷","成功一街","成功二街","成功三街","成功四街","成功五街","竹山巷","竹箋寮巷","竹寮巷","自強巷","至誠巷","西安街","志航街","志華巷","兩界巷","協和街","和平街","和正街","和昌巷","和森巷","和興街","周厝巷","尚和巷","延平一路","延平二路","延開街","忠孝街","明德巷","東山巷","東圳巷","東新街","東溪巷","東興巷","武鹿巷","花旗一路","花旗二路","花旗路","信義街","前口巷","南北巷","南洲街","南庭街","南隆街","南新街","南寮巷","南寮橫巷","後角街","後厝巷","柯厝巷","泰山一巷","泰山二巷","泰山三巷","泰山七巷","泰山九巷","泰山路","泰安街","崙北巷","崙頂巷","得勝巷","教會巷","富山巷","富仁巷","富田街","富林街","富華巷","富興巷","富興路","復新北街","復新東街","復新街","復興巷","華山一巷","華山路","華川路","華中街","華興街","華興路","黃厝巷","新生街","新吉街","新安街","新南巷","新開巷","楊厝巷","溝坪路","溪墘巷","義民巷","義竹巷","義德街","農場街","旗文路","旗甲路１段","旗甲路２段","旗甲路３段","旗甲路３段下宅巷","旗甲路４段","旗亭巷","旗南一路","旗南二路","旗南三路","旗屏一路","旗屏二路","旗屏路","旗新街","福中街","福正街","福安街","福前街","福壽街","福德街","銀店街","廟前巷","廟後巷","廣吉路","廣和路","廣清路","廣福里中興街","德昌路","德義街","樂和街","樹人路","樹人橫路","磚廠巷","篤實巷","興中路","蕉埔巷","頭林巷","龍文巷","環湖一街","環湖三街","環湖路","懷生街","鯤洲街"];
        rd_array[32] = ["選擇路段","八德街","十全街","下九寮","下竹圍","上九寮","上竹圍","上清街","上興街","大埤頭","中山路１段","中山路２段","中正路１段","中正路２段","中正路３段","中華路","中興路１段","中興路２段","五福街","五穀街","仁愛街","六寮","文化街","四維","外六寮","民生路","民族路","民權路","永安路","永華街","石橋","光明街","光明路","光復街","吉山","吉安","吉洋街","吉頂","吉豐","合和路","成功新村","成功路","竹山溝","竹門","自強街１段","自強街２段","自強街３段","和平街","和興路","忠孝路１段","忠孝路２段","東門街","信義街","南中街","柳樹塘","美中路","美興街","泰中路","泰安路","泰和","茶頂街","清水街","清興街","博愛街","復興街１段","復興街２段","朝元","圓山街","新興街","源泉","獅山街","福安街","福美路","福義街","福興","精忠新村","廣九街","廣福街","廣興街","興南街","興隆一街","興隆二街","興隆三街","龍山街","龍肚街","龍東街","龍蘭街","龜山","環湖路","雙峰街","雙溪"];
        rd_array[33] = ["選擇路段","二坡","三民路","土壠","大津","中正路","中和巷","中庄","仁愛巷","太平路","文興街","水冬瓜","水田","四維街","平和巷","民生路","民治路","光明巷","光復路","光華街","合興","竹林","尾庄","育樂巷","和平路","忠孝街","忠義街","東溪山莊","河邊巷","長春街","信義巷","南橫路","紅水坑","頂濃路","勝利街","復興巷","華中街","華北街","華南街","新民街","新威","新開","新寶","獅山","裕濃路","維新街","舊潭","舊庄巷","寶來二巷","寶來街","寶建路","檨仔腳"];
        rd_array[34] = ["選擇路段","二埔","十三甲","三崁店","下埔尾","下崁子","久采","土庫","大份田","大竹圍","大坑","大草埔","大埤墘","大崎頭","大學路","小烏山","山上","中正路","中埔","中埔頭","中新","內分子","內門","內埔","內湖","太和","木柵","牛稠崙","永安","永和","玉門","瓦寮","田子墘","石內","石車","吉民","安定","安興","州界","竹戈寮","坑口","明山","東勢埔","虎頭山","金交椅","長寮埔","長潭","南屏路","春園","柿子園","茅埔","苦苓埔","茄苳子","茄苳崙","埔尾","夏梅林","烏山坑","烏西崙","埤後","望寮","頂厝","頂寮","頂庄","富田","復興","番子路","華山","華園","萊坑","菜公坑","菜園頂","新生","腳帛寮","衙門口","隘寮","墩子腳","廣福","廣興","學子李","橫山","鴨母寮","龍山","龍潭","藤坑","寶林","檨子腳"];
        rd_array[35] = ["選擇路段","大坑","大愛路","山仙路","互愛街","內寮","日光一街","日光二街","日光三街","包容街","司馬路","合心路","合森巷","協力街","和氣街","忠義路","知足街","南河","紀念碑","茄苳巷","桐竹路","清水路","清水路中學巷","清水路公明巷","清水路田中巷","清水路合興巷","清水路朝雲巷","清水路象寮巷","清水路路西巷","清水路路東巷","通仙巷","尊重街","善解路","感恩路"];
        rd_array[36] = ["選擇路段","小林路","中山路","中正路","中和巷","中園路","中興路","五里路","仁愛路","公園路二街","文化南路","文化路","仙林巷","北平巷","北勢巷","四德巷","田寮巷","白雲巷","光華路","百葉巷","竹山巷","西拉雅路","咖啡巷","和安街","和南巷","和興巷","忠孝路","忠義路","林森路","油礦巷","南光巷","復興路","新榮巷","新興路","嘉雲巷","樂群巷","錦地巷","嶺頂巷","關西巷","關東巷","獻肚"];
        rd_array[37] = ["選擇路段","天池","北進巷","瓦阿係路","拉芙蘭路","阿其巴路","南進巷","南橫公路３段","南橫公路３段平台巷","南橫公路３段東莊巷","南橫公路３段勤和巷","南橫公路４段","南橫公路５段","建山巷","烏撒霏荷路","梅山巷","梅蘭巷","復興巷","復興路","愛玉路","瑪豹克路","樟山巷","興中巷","寶山巷"];
        rd_array[38] = ["選擇路段","大光巷","平和巷","秀嶺巷","青山巷","鞍山巷","錫安山","雙連堀"];
        rd_array[39] = ["選擇路段","多納巷","茂林巷","萬山巷"];
        rd_array[40] = ["選擇路段","大智路","大發路","大業路","大德路","中正路３段","仁愛路１段","仁愛路２段","仁愛路３段","元智街","內灣路","公園路","文化路","四維街","正大路","正遠路","民生路","民有路","民治路","民族路","民福路","民權路","白砂路","光明街","光復街","光華街","合和路","成功路","和平路３段","尚義街","尚禮街","忠孝街","東方路１段","金鑾路","信義路２段","信義路３段","建中街","建民街","建成街","建業街","建興街","茄萣路１段","茄萣路２段","健康路","崎漏一街","崎漏二街","崎漏三街","崎漏五街","崎漏路","莒光路２段","莒光路３段","頂漁路","富強路","港口路","港東街","港埔一街","港埔二街","港埔三街","港埔路","進學路","順港路","順漁路","新庄巷","福德路","賜安街","興達巷","興達路１段","濱海路１段","濱海路２段","濱海路３段","濱海路４段"];

        $("#township option").remove();
        for (j = 0; j < township_array.length; j ++) {
            $("#township").append($("<option></option>").text(township_array[j]) );
        }

        function township_onchange() {
            var index = $('#township').find(':selected').index();
            $("#street1 option,#street2 option").remove();
            for (j = 0; j < rd_array[index].length; j ++) {
                $("#street1,#street2").append($("<option></option>").text(rd_array[index][j]) );
            }
        }
    </script>
@endsection
